app/controllers/interchanges_controller.rb

	def index
		@interchanges = Interchange.all.order("created_at DESC")
---
SELECT "interchanges".* FROM "interchanges" ORDER BY created_at DESC

	def create
		@interchange = current_user.interchanges.build(interchange_params)

		if @interchange.save
---
INSERT INTO "interchanges" ("title", "model", "condition", "price", "location", "description", "change_in", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

	def update
		if @interchange.update(interchange_params)
---
UPDATE "interchanges" SET "image_updated_at" = $1, "updated_at" = $2, "image_file_name" = $3 WHERE "interchanges"."id" = $4  [["image_updated_at", 2016-12-01 13:00:53 UTC], ["updated_at", 2016-12-01 13:00:54 UTC], ["image_file_name", "skalbenke.jpg"], ["id", 1]]

	def find_iterchange
		@interchange = Interchange.find(params[:id])
---
SELECT  "interchanges".* FROM "interchanges" WHERE "interchanges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]